# Theme: Low-cost Ticket Mining

Skyscanner <br>
https://www.skyscanner.com.hk/

# The Series Data Structure

In [2]:
import pandas as pd

In [3]:
cabins = ['First Class', 'Business', 'Economy']
pd.Series(cabins)

0    First Class
1       Business
2        Economy
dtype: object

In [4]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [5]:
cabins = [None, 'Business', 'Economy']
pd.Series(cabins)

0        None
1    Business
2     Economy
dtype: object

In [6]:
numbers = [None, 2, 3]
pd.Series(numbers)

0    NaN
1    2.0
2    3.0
dtype: float64

In [7]:
import numpy as np
np.nan == None

False

In [8]:
np.nan == np.nan

False

In [9]:
np.isnan(np.nan)

True

In [10]:
hub_cities = {'CX': 'Hong Kong',
          'CI': 'Taipei',
          'NH': 'Tokyo',
          'SQ': 'Singapore'}
s = pd.Series(hub_cities)
s

CI       Taipei
CX    Hong Kong
NH        Tokyo
SQ    Singapore
dtype: object

In [11]:
s.index

Index(['CI', 'CX', 'NH', 'SQ'], dtype='object')

In [12]:
s = pd.Series(['Taipei', 'Hong Kong', 'Tokyo'], index=['CI', 'CX', 'NH'])
s

CI       Taipei
CX    Hong Kong
NH        Tokyo
dtype: object

In [13]:
hub_cities = {'CX': 'Hong Kong',
          'CI': 'Taipei',
          'NH': 'Tokyo',
          'SQ': 'Singapore'}
s = pd.Series(hub_cities, index=['CX', 'CI', 'NH'])
s

CX    Hong Kong
CI       Taipei
NH        Tokyo
dtype: object

# Exercise 1

Create a Series object: Airline names, with IATA code as index <br>
KA = Cathay Dragon ; BR = Eva Air ; JL = Japan Airlies ; KE = Korean Air

In [40]:
airlines = {'KA':'Cathay Dragon' , 'BR':'Eva Air' , 'JL':'Japan Airlies' , 'KE':'Korean Air'}
s = pd.Series(airlies)
s

NameError: name 'airlies' is not defined

# Querying a Series

In [15]:
hub_cities = {'CX': 'Hong Kong',
          'CI': 'Taipei',
          'NH': 'Tokyo',
          'SQ': 'Singapore'}
s = pd.Series(hub_cities)
s

CI       Taipei
CX    Hong Kong
NH        Tokyo
SQ    Singapore
dtype: object

In [16]:
s.iloc[3]

'Singapore'

In [17]:
s.loc['NH']

'Tokyo'

In [18]:
s[3]

'Singapore'

In [19]:
s['NH']

'Tokyo'

In [20]:
hub_cities = {99: 'Hong Kong',
          100: 'Taipei',
          101: 'Tokyo',
          102: 'Singapore'}
s = pd.Series(hub_cities)

In [21]:
s[0] #This won't call s.iloc[0] as one might expect, it generates an error instead

KeyError: 0

In [22]:
s[102]

'Singapore'

In [23]:
s = pd.Series([145.00, 88.00, 221.00, 125.00])
s

0    145.0
1     88.0
2    221.0
3    125.0
dtype: float64

In [24]:
total = 0
for item in s:
    total+=item
print(total)

579.0

In [25]:
import numpy as np

total = np.sum(s)
print(total)

579.0

In [26]:
#this creates a big series of random numbers
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

0    945
1    899
2    813
3    752
4    809
dtype: int32

In [27]:
len(s)

10000

In [28]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

718 µs ± 113 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [29]:
%%timeit -n 100
summary = np.sum(s)

138 µs ± 22 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [30]:
s+=2 #adds two to each item in s using broadcasting
s.head()

0    947
1    901
2    815
3    754
4    811
dtype: int32

In [31]:
for label, value in s.iteritems():
    s.loc[label] = value+2
s.head()

0    949
1    903
2    817
3    756
4    813
dtype: int32

In [32]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
for label, value in s.iteritems():
    s.loc[label]= value+2

4.05 s ± 131 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [33]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
s+=2

377 µs ± 188 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [34]:
s = pd.Series([1, 2, 3])
s.loc['Destination'] = 'Osaka'
s

0                  1
1                  2
2                  3
Destination    Osaka
dtype: object

In [35]:
hub_cities = pd.Series({'CX': 'Hong Kong',
          'CI': 'Taipei',
          'NH': 'Tokyo',
          'SQ': 'Singapore'})
LC_hub_cities = pd.Series(['Hong Kong',
                           'Osaka',
                           'Tokyo',
                           'Okinawa'], 
                      index=['UO',
                             'MM',
                             'MM',
                             'MM'])
all_hub_cities = hub_cities.append(LC_hub_cities)

In [36]:
hub_cities

CI       Taipei
CX    Hong Kong
NH        Tokyo
SQ    Singapore
dtype: object

In [37]:
LC_hub_cities

UO    Hong Kong
MM        Osaka
MM        Tokyo
MM      Okinawa
dtype: object

In [38]:
all_hub_cities

CI       Taipei
CX    Hong Kong
NH        Tokyo
SQ    Singapore
UO    Hong Kong
MM        Osaka
MM        Tokyo
MM      Okinawa
dtype: object

In [39]:
all_hub_cities.loc['MM']

MM      Osaka
MM      Tokyo
MM    Okinawa
dtype: object

# Exercise 2

In all_hub_cities, find the city with the largest IATA code.

In [41]:
all_hub_cities[ max(all_hub_cities.index) ]

'Hong Kong'

# Insight: The best time for purchasing flight ticket

Reference: <br>
https://www.cheapair.com/blog/2018-airfare-study-the-best-time-to-buy-flights-based-on-917-million-airfares/ <br>
https://www.skyscanner.com.hk/news/bttb-2018-hk <br>
https://www.skyscanner.com.hk/news/best-time-to-book-hk

# The DataFrame Data Structure

In [42]:
import pandas as pd
ticket_1 = pd.Series({'Name': 'Ben',
                        'Destination': 'Maldives',
                        'Price': 14610.0})
ticket_2 = pd.Series({'Name': 'Julian',
                        'Destination': 'San Francisco',
                        'Price': 3480.0})
ticket_3 = pd.Series({'Name': 'Tony',
                        'Destination': 'Shanghai',
                        'Price': 880.00})
df = pd.DataFrame([ticket_1, ticket_2, ticket_3], index=['CX', 'CX', 'KA'])
df.head()

      Destination    Name    Price
CX       Maldives     Ben  14610.0
CX  San Francisco  Julian   3480.0
KA       Shanghai    Tony    880.0

In [43]:
df.loc['KA']

Destination    Shanghai
Name               Tony
Price               880
Name: KA, dtype: object

In [44]:
type(df.loc['KA'])

pandas.core.series.Series

In [45]:
df.loc['CX']

      Destination    Name    Price
CX       Maldives     Ben  14610.0
CX  San Francisco  Julian   3480.0

In [46]:
df.loc['CX', 'Price']

CX    14610.0
CX     3480.0
Name: Price, dtype: float64

In [47]:
df.T

                   CX             CX        KA
Destination  Maldives  San Francisco  Shanghai
Name              Ben         Julian      Tony
Price           14610           3480       880

In [48]:
df.T.loc['Price']

CX    14610
CX     3480
KA      880
Name: Price, dtype: object

In [49]:
df['Price']

CX    14610.0
CX     3480.0
KA      880.0
Name: Price, dtype: float64

In [50]:
df.loc['CX']['Price']

CX    14610.0
CX     3480.0
Name: Price, dtype: float64

In [51]:
df.loc[:,['Name', 'Price']]

      Name    Price
CX     Ben  14610.0
CX  Julian   3480.0
KA    Tony    880.0

In [52]:
df.drop('CX')

   Destination  Name  Price
KA    Shanghai  Tony  880.0

In [53]:
df

      Destination    Name    Price
CX       Maldives     Ben  14610.0
CX  San Francisco  Julian   3480.0
KA       Shanghai    Tony    880.0

In [54]:
copy_df = df.copy()
copy_df = copy_df.drop('CX')
copy_df

   Destination  Name  Price
KA    Shanghai  Tony  880.0

In [55]:
copy_df.drop?

In [56]:
del copy_df['Name']
copy_df

   Destination  Price
KA    Shanghai  880.0

In [57]:
df['Flight Date'] = None
df

      Destination    Name    Price Flight Date
CX       Maldives     Ben  14610.0        None
CX  San Francisco  Julian   3480.0        None
KA       Shanghai    Tony    880.0        None

# Dataframe Indexing and Loading

In [58]:
prices = df['Price']
prices

CX    14610.0
CX     3480.0
KA      880.0
Name: Price, dtype: float64

In [59]:
prices += 160
prices

CX    14770.0
CX     3640.0
KA     1040.0
Name: Price, dtype: float64

In [60]:
df

      Destination    Name    Price Flight Date
CX       Maldives     Ben  14770.0        None
CX  San Francisco  Julian   3640.0        None
KA       Shanghai    Tony   1040.0        None

# Exercise 3

What is the price ratio between Ben's ticket and Tony's ticket ?

In [62]:
df.loc[df['Name']=='Ben','Price'].values / df.loc[df['Name']=='Tony','Price'].values

array([14.20192308])

# CX Fanfares

https://www.cathaypacific.com/cx/zh_HK/latest-offers/flights/fanfares/index.html <br>
<br>
Data from: <br>
http://roasterpig.blogspot.com/2012/10/cathay-fanfares.html

In [63]:
df = pd.read_csv('fanfares.csv')
df.head()

,Destination,Dest_Country,Cabin,Price,Price_tax,Date_start,Date_end
0,Adelaide,Australia,Economy,3480.0,4440.0,19/08/2018,09/09/2018
1,Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
2,Adelaide,Australia,Economy,3480.0,4463.0,24/06/2018,04/07/2018
3,Auckland,New Zealand,Economy,3980.0,4673.0,30/07/2018,12/08/2018
4,Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018

In [64]:
df = pd.read_csv('fanfares.csv', index_col = 0)
df.head()

            Dest_Country     Cabin    Price  Price_tax  Date_start    Date_end
Destination
Adelaide       Australia   Economy   3480.0     4440.0  19/08/2018  09/09/2018
Adelaide       Australia  Business  23080.0    24072.0  04/08/2018  29/08/2018
Adelaide       Australia   Economy   3480.0     4463.0  24/06/2018  04/07/2018
Auckland     New Zealand   Economy   3980.0     4673.0  30/07/2018  12/08/2018
Auckland     New Zealand  Business   9980.0    10673.0  13/07/2018  12/08/2018

In [65]:
df.columns

Index(['Dest_Country', 'Cabin', 'Price', 'Price_tax', 'Date_start',
       'Date_end'],
      dtype='object')

In [66]:
df.rename(columns={'Date_start':'UseDuration_Start'
                  , 'Date_end':'UseDuration_End'
                  }, inplace=True)
df.head()

,Dest_Country,Cabin,Price,Price_tax,UseDuration_Start,UseDuration_End
Destination,,,,,,
Adelaide,Australia,Economy,3480.0,4440.0,19/08/2018,09/09/2018
Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
Adelaide,Australia,Economy,3480.0,4463.0,24/06/2018,04/07/2018
Auckland,New Zealand,Economy,3980.0,4673.0,30/07/2018,12/08/2018
Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018

# Querying a DataFrame

In [67]:
df['Cabin'] == 'Business'

Destination
Adelaide             False
Adelaide              True
Adelaide             False
Auckland             False
Auckland              True
Bangalore            False
Bangkok              False
Barcelona            False
Brussels             False
Busan                False
Calcutta             False
Cebu                  True
Chennai              False
Chiang Mai           False
Chicago              False
Clark                False
Copenhagen           False
Copenhagen           False
Delhi                False
Dhaka                False
Dubai                False
Dublin               False
Fukuoka              False
Fukuoka              False
Guilin               False
Haikou               False
Hangzhou             False
Hanoi                False
Ho Chi Minh City     False
Ho Chi Minh City     False
                     ...
Nagoya               False
Nanning              False
New York (Newark)    False
Okinawa              False
Osaka                False
Osaka                False
Paris                False
Phnom Penh           False
Phnom Penh           False
Phnom Penh           False
Phuket                True
Shanghai (Pudong)    False
Qingdao              False
San Francisco        False
Sanya                False
Seoul                False
Singapore            False
Sydney               False
Taipei               False
Taipei               False
Taipei                True
Tokyo (Narita)       False
Vancouver            False
Vancouver            False
Xiamen               False
Yangon               False
Taipei               False
Taipei               False
Taipei               False
Taipei               False
Name: Cabin, Length: 69, dtype: bool

In [68]:
only_business = df.where(df['Cabin'] == 'Business')
only_business.head()

,Dest_Country,Cabin,Price,Price_tax,UseDuration_Start,UseDuration_End
Destination,,,,,,
Adelaide,NaN,NaN,NaN,NaN,NaN,NaN
Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
Adelaide,NaN,NaN,NaN,NaN,NaN,NaN
Auckland,NaN,NaN,NaN,NaN,NaN,NaN
Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018

In [69]:
only_business['Cabin'].count()

5

In [70]:
df['Cabin'].count()

69

In [71]:
only_business = only_business.dropna()
only_business.head()

,Dest_Country,Cabin,Price,Price_tax,UseDuration_Start,UseDuration_End
Destination,,,,,,
Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018
Cebu,Philippines,Business,4460.0,4790.0,07/09/2018,20/09/2018
Phuket,Thailand,Business,4430.0,4960.0,01/09/2018,17/09/2018
Taipei,Taiwan,Business,3840.0,4286.0,01/07/2018,31/07/2018

In [72]:
only_business = df[df['Cabin'] == 'Business']
only_business.head()

,Dest_Country,Cabin,Price,Price_tax,UseDuration_Start,UseDuration_End
Destination,,,,,,
Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018
Cebu,Philippines,Business,4460.0,4790.0,07/09/2018,20/09/2018
Phuket,Thailand,Business,4430.0,4960.0,01/09/2018,17/09/2018
Taipei,Taiwan,Business,3840.0,4286.0,01/07/2018,31/07/2018

In [73]:
len(df[(df['Cabin'] == 'Business') | (df['Price_tax'] > 4000)])

24

# Exercise 4

Obtain a fanfare record dataset with Business Cabin and price after tax over $10000.

In [74]:
df[(df['Cabin'] == 'Business') & (df['Price_tax'] > 10000)]

,Dest_Country,Cabin,Price,Price_tax,UseDuration_Start,UseDuration_End
Destination,,,,,,
Adelaide,Australia,Business,23080.0,24072.0,04/08/2018,29/08/2018
Auckland,New Zealand,Business,9980.0,10673.0,13/07/2018,12/08/2018

# More Reference

https://openflights.org/data.html <br>
https://www.kaggle.com/c/expedia-hotel-recommendations

# Indexing Dataframes

In [ ]:
df.head()

In [ ]:
df['Destination'] = df.index
df = df.set_index('Dest_Country')
df.head()

In [ ]:
df = df.reset_index()
df.head()

In [ ]:
df['Dest_Country'].unique()

In [ ]:
df=df[df['Cabin']=='Economy']
df.head()

In [ ]:
columns_to_keep = ['Dest_Country',
                   'Destination',
                   'Price_tax',
                   'UseDuration_Start',
                   'UseDuration_End']
df = df[columns_to_keep]
df.head()

In [ ]:
df = df.set_index(['Dest_Country', 'Destination'])
df.head()

In [ ]:
df.loc[['Taiwan', 'Taipei']]

# Exercise 5

Obtain a dataset with (Japan, Fukuoka) and (Japan, Nagoya).

In [ ]:
# ...

# Missing values

In [ ]:
df = pd.read_csv('fanfares.csv')
df_tpe = df[df['Destination']=='Taipei']
df_tpe['Date_start'] = pd.to_datetime(df_tpe['Date_start'], format="%d/%m/%Y")
df_tpe['Date_end'] = pd.to_datetime(df_tpe['Date_end'], format="%d/%m/%Y")
df_tpe

In [ ]:
df_tpe.fillna?

In [ ]:
df_tpe = df_tpe.set_index('Date_start')
df_tpe = df_tpe.sort_index()
df_tpe

In [ ]:
import datetime as dt
pd.to_datetime(df_tpe.index)

In [ ]:
type(df_tpe.index[0])

In [ ]:
df_tpe = df_tpe.reset_index()
df_tpe = df_tpe.set_index(['Cabin', 'Date_start'])
df_tpe

In [ ]:
df_tpe = df_tpe.fillna(method='ffill')
df_tpe